
**************************************************************************
* IOSv is strictly limited to use for evaluation, demonstration and IOS  *
* education. IOSv is provided as-is and is not supported by Cisco's      *
* Technical Advisory Center. Any use or disclosure, in whole or in part, *
* of the IOSv Software or Documentation to any third party for any       *
* purposes is expressly prohibited except as otherwise authorized by     *
* Cisco in writing.                                                      *
**************************************************************************Access-SW3>terminal width 511
Access-SW3>terminal length 0
Access-SW3>
Access-SW3>
Access-SW3>enable
Password: 
Access-SW3#
Access-SW3#
Access-SW3#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Access-SW3(config)#
Access-SW3(config)#int g0/1
Access-SW3(config-if)#switchport trunk encapsulation dot1q
Access-SW3(config-if)#switchport mode trunk
Access-SW3(config-if)#switchport trunk allowed vlan 10,20
Access-SW3(config-if)#vtp version 2
Access-SW3(config)#vtp mode client
Setting device to VTP Client mode for VLANS.
Access-SW3(config)#vtp domain cisco
Changing VTP domain name from NULL to cisco
Access-SW3(config)#vtp password vtpcisco123
Setting device VTP password to vtpcisco123
Access-SW3(config)#
Access-SW3(config)#end
Access-SW3#
Access-SW3#
Access-SW3#
Access-SW3#write mem
Building configuration...

  Compressed configuration from 3936 bytes to 1883 bytes[OK]
Access-SW3#
Access-SW3#exit
